cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/USBH_HS1_STM32H7xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2023 Arm Limited (or its affiliates).
 * All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        16. March 2023
 * $Revision:    V1.3
 *
 * Driver:       Driver_USBH1
 *
 * Configured:   via CubeMX
 * Project:      USB High/Full/Low-Speed Host Driver for ST STM32H7xx
 * -------------------------------------------------------------------------- */

/*! \page stm32h7_usbh0 USB Host 0

# Revision History

- Version 1.3
  - Corrected check if Host mode is enabled
- Version 1.2
  - Corrected port resume occasionally getting stuck in resume signaling
  - Added compile time configuration for reducing Bulk IN NAK rate
- Version 1.1
  - Enable VDD33USB voltage level detector if internal FS transceiver is used
- Version 1.0
  - Initial release

# Capabilities

This driver supports USB **High**, **Full** and **Low** speeds.

# Instances

Hardware resource relating to driver instance is shown in the table below:

Driver Instance | Hardware Resource
:---------------|:-----------------:
Driver_USBH0    | USB_OTG_HS

# Configuration

## Compile-time

Definitions used for compile-time configuration of this driver are shown in the table below:

Definition              | Default value | Max value | Description
:-----------------------|:-------------:|:---------:|:-----------
USBH0_MAX_PIPE_NUM      |    **16**     |      16   | Defines maximum number of Pipes that the driver will support. This value impacts driver memory requirements.
USBH0_BULK_IN_NAK_DELAY |     **0**     |   65535   | Delay between NAKs on the Bulk IN pipe (in SOFs), value 0 = not used (no delay between NAKs)

## STM32CubeMX

The USB Host driver requires:
  - **USB peripheral clock** at **48 MHz**
  - **USB_OTG_HS** peripheral configured as **Host_Only**

# STM32H743I-EVAL Board Configuration

These settings are relevant for this board, for different board please refer to the board
schematic for proper configuration.

Link to [STM32H743I-EVAL board schematic](https://www.st.com/resource/en/schematic_pack/mb1246-h743-e03_schematic.pdf).

## STM32CubeMX

Required peripherals for the **STM32H743I-EVAL** board are listed in the table below:

Peripheral  | Mode                         | Description
:----------:|:-----------------------------|:-----------
USB_OTG_HS  | Host_Only                    | USB Controller
PA3         | Alternate Function Push Pull | ULPI D0 Pin
PA5         | Alternate Function Push Pull | ULPI CLK Pin
PB0         | Alternate Function Push Pull | ULPI D1 Pin
PB1         | Alternate Function Push Pull | ULPI D2 Pin
PB5         | Alternate Function Push Pull | ULPI D7 Pin
PB10        | Alternate Function Push Pull | ULPI D3 Pin
PB11        | Alternate Function Push Pull | ULPI D4 Pin
PB12        | Alternate Function Push Pull | ULPI D5 Pin
PB13        | Alternate Function Push Pull | ULPI D6 Pin
PC0         | Alternate Function Push Pull | ULPI STP Pin
PH4         | Alternate Function Push Pull | ULPI NXT Pin
PI11        | Alternate Function Push Pull | ULPI DIR Pin

\parblock
\note For the custom VBUS handling, please provide custom implementation of the **USBH0_VbusOnOff** function
\note For the custom over-current detection, please provide custom implementation of the **USBH0_GetOC** function
\endparblock

\note All settings have to be configured as described in the procedure below. Important settings,
      typically the ones different from default, are emphasized in **bold**.

### Pinout & Configuration tab

  1. In the **Pinout view** window click on a pin and select it's functionality:
        Pin      | Functionality
        :--------|:-------------:
        PA3      | **USB_OTG_HS_ULPI_D0**
        PA5      | **USB_OTG_HS_ULPI_CLK**
        PB0      | **USB_OTG_HS_ULPI_D1**
        PB1      | **USB_OTG_HS_ULPI_D2**
        PB5      | **USB_OTG_HS_ULPI_D7**
        PB10     | **USB_OTG_HS_ULPI_D3**
        PB11     | **USB_OTG_HS_ULPI_D4**
        PB12     | **USB_OTG_HS_ULPI_D5**
        PB13     | **USB_OTG_HS_ULPI_D6**
        PC0      | **USB_OTG_HS_ULPI_STP**
        PH4      | **USB_OTG_HS_ULPI_NXT**
        PI11     | **USB_OTG_HS_ULPI_DIR**
       \n

  2. Under **Categories**: **Connectivity** select **USB_OTG_HS**:

     __Mode__:
       - External Phy: **Host_Only**
       - Internal FS Phy: Disable
       - Activate_SOF: unchecked
       - Activate_VBUS: Disable

     __Configuration__:
       - Parameter Settings: not used
       - User Constants: not used
       - NVIC Settings: configured in later step (under Category: System Core: NVIC)
       - GPIO Settings:
            Pin Name | Signal on Pin       | Pin Context..| GPIO output..| GPIO mode                     | GPIO Pull-up/Pull..| Maximum out..| Fast Mode | User Label
            :--------|:-------------------:|:------------:|:------------:|:-----------------------------:|:------------------:|:------------:|:---------:|:----------:
            PA3      | USB_OTG_HS_ULPI_D0  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PA5      | USB_OTG_HS_ULPI_CLK | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PB0      | USB_OTG_HS_ULPI_D1  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PB1      | USB_OTG_HS_ULPI_D2  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PB5      | USB_OTG_HS_ULPI_D7  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PB10     | USB_OTG_HS_ULPI_D3  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PB11     | USB_OTG_HS_ULPI_D4  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PB12     | USB_OTG_HS_ULPI_D5  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PB13     | USB_OTG_HS_ULPI_D6  | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PC0      | USB_OTG_HS_ULPI_STP | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PH4      | USB_OTG_HS_ULPI_NXT | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PI11     | USB_OTG_HS_ULPI_DIR | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
       \n

